app/controllers/posts_controller.rb

  def index
    @user = User.find(params[:user_id]) if params[:user_id]
    @posts = @user.posts if @user != nil
    @posts = Post.all if @user == nil
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "posts".* FROM "posts" WHERE "posts"."id" = 0 LIMIT 1

  def create
    @post = Post.new(params[:post])
    @post.user_id = current_user.id
    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "public", "sound", "tags", "title", "updated_at", "user_id", "waveform") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", "6"]]
UPDATE "posts" SET "content" = 'Bagpipes always sound the best in Scotland.', "public" = 't', "title" = 'Bagpipes', "sound" = 'Edinburgh_Scotland.m4a', "updated_at" = '2014-10-13 18:36:27.185327' WHERE "posts"."id" = 8